------------------------------------------------------------------------
-- Copyright (C) 2003-2005 Digital Spray Studios. All Rights Reserved.
------------------------------------------------------------------------
-- Author: Vyacheslav Korotayev
------------------------------------------------------------------------
-- Определения сопрограмм воспроизведения видео роликов. 
-- Параметы сопрограмм описаны в ds2_coroutines_templates.doc
-----------------------------------------------------------------------
COROUTINE_VIDEO_CLIP(grsvt, gaz, "avi_school", "skola2", 0, "fade_in_long", "fade_out_long", 5000)

