------------------------------------------------------------------------
-- Copyright (C) 2003-2006 Digital Spray Studios. All Rights Reserved.
------------------------------------------------------------------------
-- Authors: Vyacheslav Korotayev
------------------------------------------------------------------------
-- Свойства отображения игровых объектов в редакторе
------------------------------------------------------------------------

--[[
Таблица, содержащая свойства игровых объектов при отображении в редакторе.
Ключи - имена классов игровых объектов.

	[model_name] - Имя модели с путем, начинающимся от папки models.
Эта модель будет представлять данный объект в редакторе.

	[model_color] - Цвет модели в редакторе.
	
	[model_change_allowed] - Если true, то нельзя изменять модель для
данного объекта в редакторе. Кнопка Model будет недоступна.
--]]

entities_editing_properties = {
	--%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
	item_medikit = {
		model_name				= "Items\\ItemSpirt",
		model_color				= {0.0, 1.0, 1.0},
		model_change_allowed	= false,
	},
	
	--%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
	weapon_machinegun = {
		model_name				= "Items\\itemPPS",
		model_color				= {1.0, 0.0, 0.0},
		model_change_allowed	= false,
	},
}