------------------------------------------------------------------------
-- Copyright (C) 2003-2005 Digital Spray Studios. All Rights Reserved.
------------------------------------------------------------------------
-- Author: Vyacheslav Korotayev
------------------------------------------------------------------------
-- Информационные сообщения.
------------------------------------------------------------------------

-- Таблица, описывающая окна информационных сообщений
-- Ключи таблицы передаются в функции show_info_message и hide_info_message
------------------------------------------------------------------------
ui_info_messages = 
{
	-- ****************************************
	[0] = 
	{
		text			= "STR_GAME_SAVED",
		fonts			= {FNT_NAME_DEFAULT = "courier",},
		pos				= {32, 48},
		size			= {64, 1024},
		display_time	= 1000,
		fade_in_time	= 1500,
		fade_out_time	= 5000,
	},
	-- ****************************************
	MSG_GAME_SAVED = 
	{
		text			= "STR_GAME_SAVED",
		fonts			= {FNT_NAME_DEFAULT = "courier",},
		pos				= {32, 48},
		size			= {64, 1024},
		display_time	= 1000,
		fade_in_time	= 1500,
		fade_out_time	= 5000,
	},
}