---------------------------------------------------------------------
effectors = {}

---------------------------------------------------------------------
-- качание камеры при ходьбе
effectors["camera_bobbing"] =
{
	class_name		= "bobbing",

	period			= 0.01,
	amplitude		= 1.0/50.0,
}

---------------------------------------------------------------------
-- качание камеры при ходьбе на вприсядку
effectors["camera_bobbing_sit"] =
{
	class_name		= "bobbing_sit",

	-- период и амлитуда по горизонтали
	period_h		= 0.015,
	amplitude_h		= 1.0/150.0,

	-- период и амлитуда по вертикали
	period_v		= 0.01,
	amplitude_v		= 1.0/5500.0,
}

---------------------------------------------------------------------
-- крен камеры при стрейфе
effectors["camera_roll"] =
{
	class_name		= "roll",

	-- время возврата в нуль от максимального отклонения
	time			= 150,
	
	-- угол максимального отклонения
	max_angle		= 2,
	
	-- масштабирование боковой скорости при вычислении отклонения
	speed_scale		= 0.1,
}

---------------------------------------------------------------------
-- попадание (при нанесении удара)
effectors["camera_hit"] =
{
	class_name		= "hit",

	-- время возврата в нуль от максимального отклонения
	time			= 300,
	
	-- угол максимального отклонения
	max_angle		= 10,

	-- множитель силы удара
	hit_mult		= .05,
	
	-- points задается в виде (time, intensivity), loops задается в виде (time1, time2, count)
	--	some_parameter = { points = { {0, 0}, {0.5, 1}, {1, 0} }, loops = { {0.3, 0.7, 1} } },
		
	evaluator		= { points = { {0, 0}, {0.1, 1}, {1, 0} } },
}

---------------------------------------------------------------------
-- приседание
effectors["camera_sit"] =
{
	class_name		= "sit",

	-- скорость приседания в метрах за секунду
	speed			= 4,
}

---------------------------------------------------------------------
-- умирание
effectors["camera_death"] =
{
	class_name		= "death",

	-- скорость падения в метрах за секунду
	speed			= 4,
}

---------------------------------------------------------------------
-- качание камеры при землетрясении
effectors["camera_quake"] =
{
	class_name		= "quake",

	-- время (продолжительность эффекта)
	time			= 500,

	-- период и амлитуда по горизонтали
	period_h		= 0,
	amplitude_h		= 0,

	-- период и амлитуда по вертикали
	period_v		= 0.05,
	amplitude_v		= 5,
}
-----------------------------------------------------------------------------
-- качание камеры от работы конвеера
effectors["camera_quake_ind"] =
{
	class_name		= "quake",

	-- время (продолжительность эффекта)
	time			= 300,

	-- период и амлитуда по горизонтали
	period_h		= 0,
	amplitude_h		= 0,

	-- период и амлитуда по вертикали
	period_v		= 0.03,
	amplitude_v		= 3,
}
----------------------------------------------------------------------------
---------------------------------------------------------------------
-- качание камеры при explosion'e
effectors["camera_explosion"] =
{
	class_name		= "quake",

	-- время (продолжительность эффекта)
	time			= 500,

	-- период и амлитуда по горизонтали
	period_h		= 0.02,
	amplitude_h		= 0.1,

	-- период и амлитуда по вертикали
	period_v		= 0.015,
	amplitude_v		= 0.1,
}

---------------------------------------------------------------------
-- качание камеры при explosion'e
effectors["camera_expl"] =
{
	class_name		= "quake",

	-- время (продолжительность эффекта)
	time			= 790,

	-- период и амлитуда по горизонтали
	period_h		= 0.05,
	amplitude_h		= 1.0/20.0,

	-- период и амлитуда по вертикали
	period_v		= 0.015,
	amplitude_v		= 1.0,
}

---------------------------------------------------------------------
-- качание камеры при electric explosion'e
effectors["camera_electro_expl"] =
{
	class_name		= "quake",

	-- время (продолжительность эффекта)
	time			= 700,

	-- период и амлитуда по горизонтали
	period_h		= 0.2,
	amplitude_h		= 0.03,

	-- период и амлитуда по вертикали
	period_v		= 0.15,
	amplitude_v		= 0.03,
}

-- качание камеры при gomno_damage
effectors["camera_gomno_expl"] =
{
	class_name		= "quake",

	-- время (продолжительность эффекта)
	time			= 500,

	-- период и амлитуда по горизонтали
	period_h		= .002,
	amplitude_h		= 0.15,

	-- период и амлитуда по вертикали
	period_v		= .002,
	amplitude_v		= 0.15,
}

---------------------------------------------------------------------
-- качание камеры при jolt'e
effectors["camera_jolt_light"] =
{
	class_name		= "quake",

	-- время (продолжительность эффекта)
	time			= 250,

	-- период и амлитуда по горизонтали
	period_h		= 0.02,
	amplitude_h		= 0.01,

	-- период и амлитуда по вертикали
	period_v		= 0.015,
	amplitude_v		= 0.01,
}

---------------------------------------------------------------------
-- качание оружия при ходьбе
effectors["hand_item_bobbing"] =
{
	class_name		= "bobbing",

	period			= 0.01,
	amplitude		= -1.0/70.0,
}

---------------------------------------------------------------------
-- качание оружия при ходьбе вприсядку
effectors["hand_item_bobbing_sit"] =
{
	class_name		= "bobbing_sit",
	
	-- период и амлитуда по горизонтали
	period_h		= 0.015,
	amplitude_h		= -1.0/150.0,

	-- период и амлитуда по вертикали
	period_v		= 0.01,
	amplitude_v		= 1.0/5500.0,
}

---------------------------------------------------------------------
-- отклонения оружия при вращении камеры
effectors["hand_item_roll"] =
{
	class_name		= "hand_item_roll",

	-- время возврата в нуль от максимального отклонения по горизонтали
	time_h			= 300,

	-- время возврата в нуль от максимального отклонения по вертикали
	time_v			= 300,
	
	-- время возврата в нуль от максимального отклонения по оси z
	time_z			= 300,
	
	-- угол максимального отклонения по горизонтали
	max_angle_h		= 10,

	-- угол максимального отклонения по вертикали
	max_angle_v		= 10,
	
	-- расстояние максимального отклонения по вертикали
	max_dist_z		= 20,
	
	-- масштабирование скорости по горизонтали при вычислении отклонения
	speed_scale_h	= 0.1,

	-- масштабирование скорости по вертикали при вычислении отклонения
	speed_scale_v	= -0.1,

	-- масштабирование скорости по вертикали при вычислении отклонения
	speed_scale_z	= 0.03,
}

-- качание камеры при електрошоке
effectors["camera_electro"] =
{
	class_name		= "quake",

	-- время (продолжительность эффекта)
	time			= 100,
	
	-- период и амлитуда по горизонтали
	period_h		= 0.05,
	amplitude_h		= 0.01,

	-- период и амлитуда по вертикали
	period_v		= 0.05,
	amplitude_v		= 1,

}